music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = self.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "5sh4nr_6QKqGnlyTMZIIgw"], ["updated_at", "2018-07-12 18:40:35.465264"], ["id", 1]]

  def find_by_credentials(email, password)
    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "franklin@mail.io"], ["LIMIT", 1]]